import streamlit as st
import pandas as pd
import matplotlib.pyplot as plt
from groq import Groq
import os
import streamlit as st
import apka
import apka2

st.set_page_config(
    page_title="Data App",
    layout="wide",
    initial_sidebar_state="expanded"
)

st.sidebar.title("Навігація")

page = st.sidebar.radio(
    "Оберіть сторінку",
    [
        "🏠 Головна",
        "📊 App 1 — Monitoring",
        "🔬 App 2 — A/B Testing"
    ]
)

# --- ГОЛОВНА ---
if page == "🏠 Головна":
    st.title("📊 Data App")
    st.markdown("""
    Вітаю!Ця аплікація включає в себе моніторинг датасету та аб аналіз попередніх тестів. 
    Продуктом для якого побудований цей дашборд є додаток у ніші premium dating, орієнтований на ринок штатів.

    ### Виберіть розділ на бічній панелі:
    - **Monitoring** — огляд даних, метрики, графіки, AI-висновки
    - **A/B Testing** — Test vs Control, p-value, AI-висновки
    
    ### Дані про продукт:
        
    Монетизаційна модель - транзакційна. 
    Цільова дія користувача - спілкування користувача зкористувачами на продукті за кредити, які є можливість купити на сайті.
    Цільові користувачі - платники, які здійснили хоча б одну покупку, наша задача, щоб вони поверталися на продукт, були зацікавлені, їх активність зростала.
    Email маркетинг - один з головних каналів повернення користувачів, є певна логіка відправок листів про івенти (messages, likes, visits) для цього користувача, також важлива логіка підбору івента для користувача.
        """ )

# --- APP 1 ---
elif page == "📊 App 1 — Monitoring":
    apka.run()

# --- APP 2 ---
elif page == "🔬 App 2 — A/B Testing":
    apka2.run()


  